class script(object):


    START_MSG = """ <b>ʜᴇʟʟᴏ {}
ʏᴏᴜ ᴄᴀɴ ᴄᴀʟʟ ᴛʜɪꜱ ᴀꜱ ᴀɴ ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ ʙᴏᴛ ɪꜰ ʏᴏᴜ ʟɪᴋᴇ :ᴅ
ᴛʜɪꜱ ɪꜱ ᴠᴇʀꜱɪᴏɴ 2 ᴏꜰ ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ ʙᴏᴛ
ʙᴏᴛ ɢɪᴠᴇꜱ ʙᴜᴛᴛᴏɴ ʟɪɴᴋ ᴛᴏ ꜰɪʟᴇꜱ ɪɴ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ ᴏɴ Qᴜᴇʀʏ !
ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴀᴅᴅ ꜰɪʟᴛᴇʀꜱ ꜰᴏʀ ʏᴏᴜʀ ꜰɪʟᴇꜱ ᴏʀ ᴍᴏᴠɪᴇꜱ ꜰʀᴏᴍ ɴᴏᴡ ᴏɴ!
ꜰᴏʀ ᴍᴏʀᴇ ᴄʟɪᴄᴋ <i>/help</i></b>"""


    HELP_MSG = """<b>ʜᴏᴡ ᴛᴏ ᴜꜱᴇ ᴛʜᴇ ʙᴏᴛ??</b>

<i>
* ᴀᴅᴅ ʙᴏᴛ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴡɪᴛʜ ᴀᴅᴍɪɴ ʀɪɢʜᴛꜱ.
* ᴀᴅᴅ ʙᴏᴛ ᴛᴏ ᴄʜᴀɴɴᴇʟꜱ ᴡʜɪᴄʜ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʟɪɴᴋ ᴡɪᴛʜ <b>ᴀʟʟ ᴀᴅᴍɪɴ ʀɪɢʜᴛꜱ</b>!
</i>

<b>ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅꜱ - ᴡᴏʀᴋꜱ ɪɴ ɢʀᴏᴜᴘ ᴏɴʟʏ</b>
(ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ʙᴇ ᴀ ᴀᴜᴛʜ ᴜꜱᴇʀ ɪɴ ᴏʀᴅᴇʀ ᴛᴏ ᴜꜱᴇ ᴛʜᴇꜱᴇ ᴄᴏᴍᴍᴀɴᴅꜱ)
* <code>/ᴀᴅᴅ ᴄʜᴀɴɴᴇʟɪᴅ</code>  -  ʟɪɴᴋꜱ ᴄʜᴀɴɴᴇʟ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
ᴏʀ
* <code>/ᴀᴅᴅ @ᴄʜᴀɴɴᴇʟᴜꜱᴇʀɴᴀᴍᴇ</code> - ʟɪɴᴋꜱ ᴄʜᴀɴɴᴇʟ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ.
<i>ɴᴏᴛᴇ : ʏᴏᴜ ᴄᴀɴ ɢᴇᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪᴅ ꜰʀᴏᴍ ᴍɪꜱꜱ ʀᴏꜱᴇ ʙᴏᴛ</i>

* <code>/ᴅᴇʟ ᴄʜᴀɴɴᴇʟɪᴅ</code>  -  ᴅᴇʟɪɴᴋꜱ ᴄʜᴀɴɴᴇʟ ꜰʀᴏᴍ ɢʀᴏᴜᴘ
ᴏʀ
* <code>/ᴅᴇʟ @ᴄʜᴀɴɴᴇʟᴜꜱᴇʀɴᴀᴍᴇ</code>  -  ᴅᴇʟɪɴᴋꜱ ᴄʜᴀɴɴᴇʟ ꜰʀᴏᴍ ɢʀᴏᴜᴘ
<i>ɴᴏᴛᴇ : ʏᴏᴜ ᴄᴀɴ ɢᴇᴛ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟ ᴅᴇᴛᴀɪʟꜱ ʙʏ <code>/ꜰɪʟᴛᴇʀꜱᴛᴀᴛꜱ</code> </i>

* <code>/ᴅᴇʟᴀʟʟ</code>  -  ʀᴇᴍᴏᴠᴇꜱ ᴀʟʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ ᴀɴᴅ ꜰɪʟᴛᴇʀꜱ ꜰʀᴏᴍ ɢʀᴏᴜᴘ!
<i>ɴᴏᴛᴇ : ᴅᴏɴᴛ ᴀᴅᴅ ᴄᴏᴍᴍᴀɴᴅ ᴅᴇʟᴇᴛᴇ ʙᴏᴛꜱ ɪɴ ɢʀᴏᴜᴘ! ᴏᴛʜᴇʀᴡɪꜱᴇ, ᴅᴇʟᴀʟʟ ᴄᴏᴍᴍᴀɴᴅ ᴡᴏɴᴛ ᴡᴏʀᴋ</i>

* <code>/ꜰɪʟᴛᴇʀꜱᴛᴀᴛꜱ</code>  -  ᴄʜᴇᴄᴋ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ ᴀɴᴅ ɴᴜᴍʙᴇʀ ᴏꜰ ꜰɪʟᴛᴇʀꜱ.

ɴᴏ ɴᴇᴇᴅ ᴀᴅᴅ ᴇᴀᴄʜ ꜰɪʟᴛᴇʀ ᴀɢᴀɪɴ!
ʙᴏᴛ ᴡɪʟʟ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ꜱᴇᴀʀᴄʜ ꜰᴏʀ ʏᴏᴜʀ ꜰɪʟᴇꜱ ᴀɴᴅ ɢɪᴠᴇ ʟɪɴᴋꜱ ᴛᴏ ᴛʜᴀᴛ!

<b>© @ᴘʀᴏʙ3ᴛᴏʀ</b>"""


    ABOUT_MSG = """💠<b>ᴍʏ ɴᴀᴍᴇ  : ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ ʙᴏᴛ ᴠ2</b>
💠<b>ᴄʀᴇᴀᴛᴇʀ  :</b> <a href='https://t.me/hcn_bots'>ʜᴄɴ ʙᴏᴛꜱ</a>
💠<b>ʟᴀɴɢᴜᴀɢᴇ :</b> <code>ᴘʏᴛʜᴏɴ3</code>
💠<b>ʟɪʙʀᴀʀʏ  :</b> <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ 1.0.7</a> 

"""
